### Analysis_Mall_Customer
This Project is for analysing mall customer based on attributes like age, gender,annual_income,Spending_Score.
Few Question to Answer:
1. Which age gruop is higher in density?
2. Which gender spends more?
3. Is there any relation between age/gender/annual_income and spending_score?

Note: This project is for practice purpose.
Source of Data: Kaggle.
Link:https://www.kaggle.com/shwetabh123/mall-customers

In [1]:
import pandas as pd
import numpy as np

In [79]:
data = pd.read_csv('Mall_Customers.csv')
data.head()

   CustomerID   Genre  Age  Annual Income (k$)  Spending Score (1-100)
0           1    Male   19                  15                      39
1           2    Male   21                  15                      81
2           3  Female   20                  16                       6
3           4  Female   23                  16                      77
4           5  Female   31                  17                      40

In [80]:
data = data.rename(columns = {'Genre':'Gender','Annual Income (k$)': 'Annual_Income','Spending Score (1-100)':'Spending_Score' })
data.head()

   CustomerID  Gender  Age  Annual_Income  Spending_Score
0           1    Male   19             15              39
1           2    Male   21             15              81
2           3  Female   20             16               6
3           4  Female   23             16              77
4           5  Female   31             17              40

In [81]:
data = data.set_index('CustomerID')

In [82]:
data.head()

            Gender  Age  Annual_Income  Spending_Score
CustomerID
1             Male   19             15              39
2             Male   21             15              81
3           Female   20             16               6
4           Female   23             16              77
5           Female   31             17              40

In [83]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 200 entries, 1 to 200
Data columns (total 4 columns):
Gender            200 non-null object
Age               200 non-null int64
Annual_Income     200 non-null int64
Spending_Score    200 non-null int64
dtypes: int64(3), object(1)
memory usage: 7.8+ KB

In [84]:
data.shape

(200, 4)

In [85]:
data.corr()

                     Age  Annual_Income  Spending_Score
Age             1.000000      -0.012398       -0.327227
Annual_Income  -0.012398       1.000000        0.009903
Spending_Score -0.327227       0.009903        1.000000

In [86]:
data.describe()

              Age  Annual_Income  Spending_Score
count  200.000000     200.000000      200.000000
mean    38.850000      60.560000       50.200000
std     13.969007      26.264721       25.823522
min     18.000000      15.000000        1.000000
25%     28.750000      41.500000       34.750000
50%     36.000000      61.500000       50.000000
75%     49.000000      78.000000       73.000000
max     70.000000     137.000000       99.000000

In [87]:
data = data.reset_index()
data.head()
data.groupby(data.Age//10*10)['CustomerID'].count()

Age
10    12
20    43
30    61
40    39
50    25
60    18
70     2
Name: CustomerID, dtype: int64